Revit 2025 API
RebarShape.GetHookRotationAngle Method
 Gets the out of plane hook rotation angle at the specified end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double GetHookRotationAngle(
	int iEnd
)
Public Function GetHookRotationAngle (
	iEnd As Integer
) As Double
public:
double GetHookRotationAngle(
	int iEnd
)
member GetHookRotationAngle :
        iEnd : int -> float
Parameters
iEnd Int32
 0 for the start , 1 for the end.
Return Value
Double
 Returns the out of plane hook rotation angle at the specified end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  iEnd must be 0 or 1.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace